testing/case_1p0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
10981
(
(0.00450053 -1.74566e-07 5.40761e-24)
(0.00449248 -6.06004e-08 5.78694e-24)
(0.00987282 -9.27009e-07 4.02784e-24)
(0.0045039 -1.46627e-07 0)
(0.00449127 3.16704e-07 3.40797e-25)
(0.00986329 -1.18264e-06 -4.02317e-24)
(0.0129771 -1.28704e-06 0)
(0.00987512 -3.61122e-07 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
