testing/case_1p0/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
1.87796e-06
1.88711e-06
1.8812e-06
1.86859e-06
1.89611e-06
1.88972e-06
1.47765e-06
1.87104e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
5.46791e-06
5.19253e-06
4.59363e-06
3.98252e-06
3.30996e-06
2.64269e-06
2.128e-06
1.74813e-06
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
1.87796e-06
1.88711e-06
1.89611e-06
1.89956e-06
1.89708e-06
1.88602e-06
1.86685e-06
1.84217e-06
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
