testing/case_1p0/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
1.69027e-06
1.69852e-06
1.21096e-05
1.68181e-06
1.7123e-06
1.21588e-05
1.50221e-05
1.20609e-05
...
)
;

boundaryField
{
    bottomWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
139
(
9.81492e-08
8.88606e-08
6.89385e-08
4.83959e-08
2.77781e-08
1.34359e-08
6.99427e-09
4.15e-09
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
139
(
1.1988e-08
1.21037e-08
1.23384e-08
1.27514e-08
1.34164e-08
1.432e-08
1.54268e-08
1.67221e-08
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
